"""Storer for duel phrases and actions."""

PHRASE_START = [
    'В ходе дуэли',
    'Во время схватки',
    'Серьезно настроенный',
    'Как по книге',
    'Сегодня мы можем наблюдать обычный день в Африке - '
]

KILL_ACTIONS = [
    'как ковбой выстрелил из револьвера',
    'решил пригреть оппонента своей любимой сковородой',
    'сьел гриб, превратился в берсерка, атаковал',
]

DEATH_ACTIONS = [
    'умер',
    'мертв',
    'откинул копытцы',
    'был похоронен на скорую руку',
    'не забыл вырыть себе могилу! Мне меньше работы, ура'
]

MISS_ACTIONS = [
    'промазал',
    'не попал',
    'промахнулся',
    'скосил',
]

DRAW_PROBLEM = [
    'Зачем я здесь? Я ожидал представление, а вышло это! Мы вообще существуем? Что тут происходит?',
    'Только зря время потратили...',
    'Лучше бы книги читал и не приходил сюда... ',
    'В книгах это обычно по другому описывается. Говорил же, книги постоянно врут!',
    'А где романтизм? Я ничего не понял. Пушкин соврал?'
]

DRAW_ACTIONS = [
    'Объявляется ничья!',
    'Победителей нет!',
    'Ничья!'
]

SUCC_ACTION = [
    'прикончил свою цель',
    'убил своего оппонента',
    'отправил врага в небытие',
    'реально смог (я не даже ожидал)',
    'реально смог (хотя это было ожидаемо)',
    'опушкинил своего врага'
]
